k = 0
for a in range(1000, 9999+1):
    a1 = a // 1000
    a2 = a // 100 % 10
    a3 = a // 10 % 10
    a4 = a % 10
    if a1 % 2 == 0:
        if a2 % 2 == 0:
            if a3 % 2 == 0:
                if a4 % 2 == 0:
                    k += 1
print(k)
# найти количество всех четырехзначных чисел у которых хотя бы одна из цифр нечетна
k = 0
for a in range(1000, 9999+1):
    a1 = a // 1000
    a2 = a // 100 % 10
    a3 = a // 10 % 10
    a4 = a % 10
    if a1 % 2 != 0 or a2 % 2 != 0 or a3 % 2 != 0 or a4 % 2 != 0:
        k += 1
print(k)

